; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-5nodes-1000size-5degree-100mindistance-2trucks-6packages-1200seed

(define (problem transport-three-cities-sequential-5nodes-1000size-5degree-100mindistance-2trucks-6packages-1200seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 858,497 -> 941,904
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 42)
  ; 941,904 -> 858,497
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 42)
  ; 463,141 -> 201,741
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 66)
  ; 201,741 -> 463,141
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 66)
  ; 463,141 -> 259,43
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 23)
  ; 259,43 -> 463,141
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 23)
  ; 463,141 -> 858,497
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 54)
  ; 858,497 -> 463,141
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 54)
  ; 2627,622 -> 2831,206
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 47)
  ; 2831,206 -> 2627,622
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 47)
  ; 2248,461 -> 2831,206
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 64)
  ; 2831,206 -> 2248,461
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 64)
  ; 2248,461 -> 2627,622
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 42)
  ; 2627,622 -> 2248,461
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 42)
  ; 2008,263 -> 2248,461
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 32)
  ; 2248,461 -> 2008,263
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 32)
  ; 2558,464 -> 2831,206
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 38)
  ; 2831,206 -> 2558,464
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 38)
  ; 2558,464 -> 2627,622
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 18)
  ; 2627,622 -> 2558,464
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 18)
  ; 2558,464 -> 2248,461
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 31)
  ; 2248,461 -> 2558,464
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 31)
  ; 2558,464 -> 2008,263
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 59)
  ; 2008,263 -> 2558,464
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 59)
  ; 1898,2484 -> 1530,2950
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 60)
  ; 1530,2950 -> 1898,2484
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 60)
  ; 1655,2196 -> 1205,2001
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 49)
  ; 1205,2001 -> 1655,2196
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 49)
  ; 1655,2196 -> 1898,2484
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 38)
  ; 1898,2484 -> 1655,2196
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 38)
  ; 1768,2062 -> 1205,2001
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 57)
  ; 1205,2001 -> 1768,2062
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 57)
  ; 1768,2062 -> 1898,2484
  (road city-3-loc-5 city-3-loc-3)
  (= (road-length city-3-loc-5 city-3-loc-3) 45)
  ; 1898,2484 -> 1768,2062
  (road city-3-loc-3 city-3-loc-5)
  (= (road-length city-3-loc-3 city-3-loc-5) 45)
  ; 1768,2062 -> 1655,2196
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 18)
  ; 1655,2196 -> 1768,2062
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 18)
  ; 858,497 <-> 2008,263
  (road city-1-loc-4 city-2-loc-4)
  (= (road-length city-1-loc-4 city-2-loc-4) 118)
  (road city-2-loc-4 city-1-loc-4)
  (= (road-length city-2-loc-4 city-1-loc-4) 118)
  (road city-1-loc-3 city-3-loc-4)
  (= (road-length city-1-loc-3 city-3-loc-4) 125)
  (road city-3-loc-4 city-1-loc-3)
  (= (road-length city-3-loc-4 city-1-loc-3) 125)
  (road city-2-loc-2 city-3-loc-4)
  (= (road-length city-2-loc-2 city-3-loc-4) 177)
  (road city-3-loc-4 city-2-loc-2)
  (= (road-length city-3-loc-4 city-2-loc-2) 177)
  (at package-1 city-2-loc-2)
  (at package-2 city-1-loc-2)
  (at package-3 city-3-loc-3)
  (at package-4 city-1-loc-2)
  (at package-5 city-2-loc-1)
  (at package-6 city-2-loc-1)
  (at truck-1 city-3-loc-1)
  (capacity truck-1 capacity-4)
  (at truck-2 city-1-loc-4)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-1)
  (at package-2 city-3-loc-2)
  (at package-3 city-2-loc-1)
  (at package-4 city-2-loc-2)
  (at package-5 city-2-loc-3)
  (at package-6 city-1-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-3)
   goals met: 0 of 6
2. (pick-up truck-1 city-3-loc-3 package-3 capacity-3 capacity-4)
   deleted: (at package-3 city-3-loc-3) (capacity truck-1 capacity-4)
   added: (in package-3 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 6
3. (drive truck-1 city-3-loc-3 city-3-loc-4)
   deleted: (at truck-1 city-3-loc-3)
   added: (at truck-1 city-3-loc-4)
   goals met: 0 of 6
4. (drive truck-1 city-3-loc-4 city-2-loc-2)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 6
5. (pick-up truck-1 city-2-loc-2 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-2-loc-2) (capacity truck-1 capacity-3)
   added: (in package-1 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 6
6. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 6
7. (pick-up truck-1 city-2-loc-1 package-6 capacity-1 capacity-2)
   deleted: (at package-6 city-2-loc-1) (capacity truck-1 capacity-2)
   added: (in package-6 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 6
8. (pick-up truck-1 city-2-loc-1 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-2-loc-1) (capacity truck-1 capacity-1)
   added: (in package-5 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 6
9. (drop truck-1 city-2-loc-1 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-0)
   added: (at package-3 city-2-loc-1) (capacity truck-1 capacity-1)
   goals met: 1 of 6
10. (drop truck-1 city-2-loc-1 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-1)
   added: (at package-1 city-2-loc-1) (capacity truck-1 capacity-2)
   goals met: 2 of 6
11. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 2 of 6
12. (drop truck-1 city-2-loc-3 package-5 capacity-2 capacity-3)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-2)
   added: (at package-5 city-2-loc-3) (capacity truck-1 capacity-3)
   goals met: 3 of 6
13. (drive truck-1 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-4)
   goals met: 3 of 6
14. (drive truck-1 city-2-loc-4 city-1-loc-4)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-1-loc-4)
   goals met: 3 of 6
15. (drive truck-1 city-1-loc-4 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-5)
   goals met: 3 of 6
16. (drive truck-1 city-1-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 3 of 6
17. (pick-up truck-1 city-1-loc-2 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-2) (capacity truck-1 capacity-3)
   added: (in package-4 truck-1) (capacity truck-1 capacity-2)
   goals met: 3 of 6
18. (pick-up truck-1 city-1-loc-2 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-2) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 3 of 6
19. (drive truck-1 city-1-loc-2 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-5)
   goals met: 3 of 6
20. (drop truck-1 city-1-loc-5 package-6 capacity-1 capacity-2)
   deleted: (in package-6 truck-1) (capacity truck-1 capacity-1)
   added: (at package-6 city-1-loc-5) (capacity truck-1 capacity-2)
   goals met: 4 of 6
21. (drive truck-1 city-1-loc-5 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-4)
   goals met: 4 of 6
22. (drive truck-1 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-3)
   goals met: 4 of 6
23. (drive truck-1 city-1-loc-3 city-3-loc-4)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-3-loc-4)
   goals met: 4 of 6
24. (drive truck-1 city-3-loc-4 city-2-loc-2)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-2-loc-2)
   goals met: 4 of 6
25. (drop truck-1 city-2-loc-2 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-2)
   added: (at package-4 city-2-loc-2) (capacity truck-1 capacity-3)
   goals met: 5 of 6
26. (drive truck-1 city-2-loc-2 city-3-loc-4)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-3-loc-4)
   goals met: 5 of 6
27. (drive truck-1 city-3-loc-4 city-3-loc-2)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-3-loc-2)
   goals met: 5 of 6
28. (drop truck-1 city-3-loc-2 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-3)
   added: (at package-2 city-3-loc-2) (capacity truck-1 capacity-4)
   goals met: 6 of 6
